/*
Достоинство отдельных скриптов в том, что
они могут сохраняться в кеш, что ускорит загрузку
страниц и сократит трафик

лучше ставить точку с зяпятой т.к.
в некоторых случаях это может привести
к ошибкам
// можно использовать Ctrl + Shift + Enter для перехода
чтобы в конце строки ставилась ;
ctrl+shift+/ - многострочный комментарий
 */
//эта строчка нужна чтобы
//js работал по стандарту es5
//данный режим можно использовать только для конкретных
// функций
//shift+enter
"use strict";

console.log( 'Привет, мир!' );
//если не поставить ; то будет неправильный вывод
alert("; error");
[1, 2].forEach(alert);























































































